'use strict';
// 프로그램 3단계

// 1. input(입력을 받음)
// 2. process(이 부분을 배우는거야!!!!!)
// 3. output(출력)

// 비트연산자는 다루지 않음. 
// 프론트, 백에서는 거의 사용되지 않음.

// 리터럴(Literal)
// 값을 나타내는 표기법(그 값을 어떻방식으로 써?)
// "", ''는 문자열 리터럴
// ``템플릿 리터럴
// 3 0x, 0b, 0o 등등.. 숫자 리터럴
// true, false 불린 리터럴
// {} 객체 리터럴
// [] 배열 리터럴

// Statement(문)
// 프로그램이 최소한으로 실행될 수 있는 단위(한 문장)

// if`문` 반복`문` 실행`문`

// 표현식(Expressions)
//! Statement중 `값`으로 평가가 된다면 이를 표현식이라고 해!

// 정리
// 모든 코드는 Statement문인데, 이 중 값이라면 표현식(Expressions)라고 한다.
// ex) 숫자 리터럴은 문이자 표현식이다.
// 1 + 1도 값이니까 표현식임
// for문은 문이지만 expressions는 아님.

// js는 문이 끝나면 ;가 없다면 넣어주는데 우리가 넣어주자!

// ! point!! 
// 코드가 실행되면 어떤 일이 발생하는가?
// 코드가 실행되면 어떤 값이 생성되는가?
// 이 변수에는 어떤 값이 들어있는가?
// ! 이 3가지를 유념해서 코딩하자!