/**
 * << 총 정리 >> 
 * 1. 메모리
 * -> app을 실행할 때 메모리는 어떻게 구성되어 있는가???
 * 
 * 2. 변수
 * -> application에서 필요한 data를 저장할 수 있는 << 사물함 >> 
 * -> 함수에서는 파라미터라고 봐도 돼!
 * 
 * 3. 데이터 타입 
 * -> 변수에 담을 수 있는 데이터 종류!! -> primitive && object
 * 
 * 4. 연산자
 * -> 저 데이터들을 처리할 때 필요한 연산(함수 코드블럭)
 * 
 * 5. 제어문(조건, 반복문)
 * -> 코드를 제어할 수 있는 제어문
 * 
 * 6. 함수
 * -> 처리하는데 필요한 기능
 * 
 * 7. 객체
 * -> 관계있는 변수와 함수를 묶어놓은 것. 
 * -> 리터럴, 생성자함수, class 
 * 
 * 8. 내장객체
 * - ! << 자바스크립트 객체 종류 >>
 * 
 * (1). 내장객체 - 자바스크립트 엔진에 내장되어 있는 객체를 의미함.
 *  - Date객체(class)
 *  - Math클래스
 *  - arr메서드 등등.. 
 *  - 단점 : 네트워크 전송, 브라우져 화면 보여주기, 컴퓨터 파일 읽기 불가능
 *  - --> 그래서 브라우져나 node api들을 이용해야 함. 
 * 
 * (2). browser API(런타임 환경이 브라우져) and node api
 * 
 * (3). 사용자 정의 객체
 * 
 * 9. 배열(진짜 미친듯이 중요함.)
 * 
 */